thibautldz/BLE_Scanner/STM32_WPAN/App/p2p_client_app.c
	case(UUID_WRITE_WNR) :
		aP2PClientContext[num_property].state = APP_BLE_DISCOVER_WRITE_DESC;
		aP2PClientContext[num_property].P2PWriteToServerCharHdle = scan_services[num_service].handle_serv[num_property];
	break;

	case(UUID_READ_WRITE_WNR) :
		APP_DBG_MSG("You want to read [type : 1] or write [type : 2] \n\r");
		HW_UART_Receive_IT(hw_uart1, buff_RorW , sizeof(buff_RorW), rx_usartCallBack_ReadorWrite);
	break;

	case(UUID_READ_WRITE) :
		APP_DBG_MSG("You want to read [type : 1] or write [type : 2] \n\r");
		HW_UART_Receive_IT(hw_uart1, buff_RorW , sizeof(buff_RorW), rx_usartCallBack_ReadorWrite);
	break;

	case(UUID_WRITE) :
		aP2PClientContext[num_property].state = APP_BLE_DISCOVER_WRITE_DESC;
		aP2PClientContext[num_property].P2PWriteToServerCharHdle = scan_services[num_service].handle_serv[num_property];
	break;

	case(UUID_NOTIFY) :
		aP2PClientContext[num_property].state = APP_BLE_ENABLE_NOTIFICATION_DESC;
        aP2PClientContext[num_property].P2PNotificationCharHdle = scan_services[num_service].handle_serv[num_property];
	break;

	case(UUID_INDICATES) :
		aP2PClientContext[num_property].state = APP_BLE_ENABLE_NOTIFICATION_DESC;
		aP2PClientContext[num_property].P2PNotificationCharHdle = scan_services[num_service].handle_serv[num_property];
	break;

	default :
	break;
	}
	}
}
static void display_UUID( uint8_t * package, uint8_t idx )
{
	uint16_t tab_construct_UUID[7];
	for(uint8_t i=0 ; i < 8; i++)
	{
		tab_construct_UUID[i] = UNPACK_2_BYTE_PARAMETER(&package[(idx+2)-2*i]);
	}

	 APP_DBG_MSG("UUID : %4X%4X-%4X-%4X-%4X-%4X%4X%4X",tab_construct_UUID[0],
	                                                   tab_construct_UUID[1],
						                               tab_construct_UUID[2],
										               tab_construct_UUID[3],
													   tab_construct_UUID[4],
													   tab_construct_UUID[5],
													   tab_construct_UUID[6],
													   tab_construct_UUID[7]);
}
static uint8_t contains_property( uint16_t handle )
{
	uint8_t ret = 0;
	for(int i = 0; i < index_services; i++)
	{
		for(int y = 0; y < index_properties; y++)
		{
			if(handle == scan_services[i].handle_serv[y])
			{
				ret = 1;
			}
		}
	}
	return ret;
}

void P2PC_APP_Init(void)
{
  uint8_t index =0;
/* USER CODE BEGIN P2PC_APP_Init_1 */
  UTIL_SEQ_RegTask( 1<< CFG_TASK_SEARCH_SERVICE_ID, UTIL_SEQ_RFU, Update_Service );
  UTIL_SEQ_RegTask( 1<< CFG_TASK_SW1_BUTTON_PUSHED_ID, UTIL_SEQ_RFU, Button_Trigger_Received );
  UTIL_SEQ_RegTask( 1<< CFG_TASK_SELECT_SERVICE, UTIL_SEQ_RFU, rx_usart_Service);

  /**
   * Initialize LedButton Service
   */
  P2P_Client_App_Context.Notification_Status=0;
  P2P_Client_App_Context.ConnectionHandle =  0x00;

  P2P_Client_App_Context.LedControl.Device_Led_Selection=0x00;/* device Led */
  P2P_Client_App_Context.LedControl.Led1=0x00; /* led OFF */
  P2P_Client_App_Context.ButtonStatus.Device_Button_Selection=0x01;/* Device1 */
  P2P_Client_App_Context.ButtonStatus.Button1=0x00;
/* USER CODE END P2PC_APP_Init_1 */
  for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
  {
    aP2PClientContext[index].state= APP_BLE_IDLE;
  }

  /**
   *  Register the event handler to the BLE controller
   */
  SVCCTL_RegisterCltHandler(Event_Handler);

#if(CFG_DEBUG_APP_TRACE != 0)
  APP_DBG_MSG("-- P2P CLIENT INITIALIZED \n\r");
#endif

/* USER CODE BEGIN P2PC_APP_Init_2 */

/* USER CODE END P2PC_APP_Init_2 */
  return;
}

void P2PC_APP_Notification(P2PC_APP_ConnHandle_Not_evt_t *pNotification)
{
/* USER CODE BEGIN P2PC_APP_Notification_1 */

/* USER CODE END P2PC_APP_Notification_1 */
  switch(pNotification->P2P_Evt_Opcode)
  {
/* USER CODE BEGIN P2P_Evt_Opcode */

/* USER CODE END P2P_Evt_Opcode */

  case PEER_CONN_HANDLE_EVT :
/* USER CODE BEGIN PEER_CONN_HANDLE_EVT */
    P2P_Client_App_Context.ConnectionHandle = pNotification->ConnectionHandle;
/* USER CODE END PEER_CONN_HANDLE_EVT */
      break;

    case PEER_DISCON_HANDLE_EVT :
/* USER CODE BEGIN PEER_DISCON_HANDLE_EVT */
      {
      uint8_t index = 0;
      P2P_Client_App_Context.ConnectionHandle =  0x00;
      while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                  (aP2PClientContext[index].state != APP_BLE_IDLE))
      {
        aP2PClientContext[index].state = APP_BLE_IDLE;
      }
      BSP_LED_Off(LED_BLUE); 
        
#if OOB_DEMO == 0
      UTIL_SEQ_SetTask(1<<CFG_TASK_CONN_DEV_1_ID, CFG_SCH_PRIO_0);
#endif 
      }
/* USER CODE END PEER_DISCON_HANDLE_EVT */
      break;

    default:
/* USER CODE BEGIN P2P_Evt_Opcode_Default */

/* USER CODE END P2P_Evt_Opcode_Default */
      break;
  }
/* USER CODE BEGIN P2PC_APP_Notification_2 */

/* USER CODE END P2PC_APP_Notification_2 */
  return;
}
/* USER CODE BEGIN FD */
void P2PC_APP_SW1_Button_Action(void)
{

  UTIL_SEQ_SetTask(1<<CFG_TASK_SW1_BUTTON_PUSHED_ID, CFG_SCH_PRIO_0);

}
/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief  Event handler
 * @param  Event: Address of the buffer holding the Event
 * @retval Ack: Return whether the Event has been managed or not
 */
static SVCCTL_EvtAckStatus_t Event_Handler(void *Event)
{
  SVCCTL_EvtAckStatus_t return_value;
  hci_event_pckt *event_pckt;
  evt_blue_aci *blue_evt;

  P2P_Client_App_Notification_evt_t Notification;

  return_value = SVCCTL_EvtNotAck;
  event_pckt = (hci_event_pckt *)(((hci_uart_pckt*)Event)->data);

  switch(event_pckt->evt)
  {
    case EVT_VENDOR:
    {
      blue_evt = (evt_blue_aci*)event_pckt->data;
      switch(blue_evt->ecode)
      {

        case EVT_BLUE_ATT_READ_BY_GROUP_TYPE_RESP:
        {
          aci_att_read_by_group_type_resp_event_rp0 *pr = (void*)blue_evt->data;
          uint8_t numServ, i, idx;
          uint16_t uuid, handle;

          uint8_t index;
          handle = pr->Connection_Handle;
          index = 0;
          while(
                (aP2PClientContext[index].state != APP_BLE_IDLE))
          {
            APP_BLE_ConnStatus_t status;

            status = APP_BLE_Get_Client_Connection_Status(aP2PClientContext[index].connHandle);

